sbcl-projects.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Project Ideas</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-03-27 23:55:33 CET"/>
<meta name="author" content="pkhuong"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Project Ideas</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Unicode Integration </a>
<ul>
<li><a href="#sec-1.1">1.1 Deliverables </a></li>
<li><a href="#sec-1.2">1.2 Prerequisites </a></li>
<li><a href="#sec-1.3">1.3 Student learning </a></li>
</ul>
</li>
<li><a href="#sec-2">2 Exploiting GMP for bignum and rational arithmetic </a>
<ul>
<li><a href="#sec-2.1">2.1 Deliverables </a></li>
<li><a href="#sec-2.2">2.2 Prerequisites </a></li>
<li><a href="#sec-2.3">2.3 Student learning </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Unicode Integration </h2>
<div class="outline-text-2" id="text-1">

<p>SBCL has a simple-minded implementation of Unicode support: each
Unicode codepoint is a single Lisp character, and strings are
sequences of codepoints. This implementation meets the principle of
least surprise, but has left some rough edges; the project here
involves exploring some of those rough edges and smoothing them
down. The project involves: implementation and testing (from test
vectors and differentially) of a number of Unicode algorithms, and
(the interesting bit) integrating those algorithms in a tasteful way
in the language runtime: for example, by using the normalization
algorithm in symbol equality, allowing easy use of collation keys for
sorting, or syllable breaking in the pretty-printer or formatter.
</p>

</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> Deliverables </h3>
<div class="outline-text-3" id="text-1.1">

<ol>
<li>
CL implementations of algorithms specified in the Unicode standards;
</li>
<li>
Integration of these algorithms into the the SBCL language runtime;
</li>
<li>
Integration of test cases into the SBCL build sequence;
</li>
<li>
Exploratory work in <i>using</i> these algorithms in suitable places in
the Lisp language runtime.

</li>
</ol>
</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> Prerequisites </h3>
<div class="outline-text-3" id="text-1.2">

<p>There are no hard prerequisites for this project; an interest in
internationalization issues would be helpful, as would prior
experience with working with Unicode.
</p>
</div>

</div>

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3"><span class="section-number-3">1.3</span> Student learning </h3>
<div class="outline-text-3" id="text-1.3">

<p>A student successfully executing this project would learn about: data
structures for efficient information storage; test methodologies; and
working within the strictures of standardized algorithms and
languages.
</p>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Exploiting GMP for bignum and rational arithmetic </h2>
<div class="outline-text-2" id="text-2">

<p>SBCL has a reasonably simple but decent implementation of arbitrary
precision integers and rationals; its design is also informed by the
Common Lisp specification, in particular support for bitwise operation
in two's complement.  GNU MP (GMP) offers sophisticated routines that
would be extremely useful when working with medium and large bignums
or rationals, but calls to GMP entails conversion to/from
sign-magnitude representation, and foreign function interface
overhead.  The project requires the integration of GMP in SBCL,
ideally as an optional module ("contrib"), the development of
efficient conversion algorithms between GMP's and SBCL's concrete
representations, and the determination of cross-over points between
SBCL's and GMP's routines.  This work would probably be appreciated by
symbolic computing applications (e.g. maxima).
</p>

</div>

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1"><span class="section-number-3">2.1</span> Deliverables </h3>
<div class="outline-text-3" id="text-2.1">

<ol>
<li>
(partial) Foreign function interface definitions for GMP;
</li>
<li>
Development of routines to convert between two's complement and
sign-magnitude representation;
</li>
<li>
Integration in SBCL's existing bignum and rational arithmetic code;
</li>
<li>
Determination of criteria for the use of GMP's routines to improve
performance on large integer or rationals, as used in applications,
without overly penalising the common case of tiny values;
</li>
<li>
Development of unit tests for the new routines;
</li>
<li>
Improvement of SBCL's algorithms for small or medium bignums and
rationals (optional).

</li>
</ol>
</div>

</div>

<div id="outline-container-2.2" class="outline-3">
<h3 id="sec-2.2"><span class="section-number-3">2.2</span> Prerequisites </h3>
<div class="outline-text-3" id="text-2.2">

<p>Familiarity with Common Lisp and C. An interest in number theory would
be useful, and may provide additional motivation.
</p>
</div>

</div>

<div id="outline-container-2.3" class="outline-3">
<h3 id="sec-2.3"><span class="section-number-3">2.3</span> Student learning </h3>
<div class="outline-text-3" id="text-2.3">

<p>The student would learn to characterise the use of a small part of a
system (bignum and rational arithmetic) by various applications, and
develop microbenchmarks accordingly, in order to make non-obvious
technical decisions.  They would also exercise test methodologies, and
potentially implement algorithms described by specialised scientific
literature.
</p></div>
</div>
</div>
<div id="postamble">
<p class="date"> Date: 2013-03-27 23:55:33 CET</p>
</div>
</div>
</body>
</html>
